enginestein/DeckOS_ESP32/main/commands/commands.c
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <ctype.h>
#include <time.h>
#include <sys/time.h>

#include "hal.h"
#include "bg_job.h"
#include "file_persist.h"
#include "editor.h"
#include "module.h"
#include "oled.h"
#include "print_lock.h"
#include "commands.h"
#include "kernel.h"
#include "dscript.h"
#include "drivers.h"
#include "vfs.h"
#include "uart_detect.h"
#include "board_detect.h"
#include "scheduler.h"
#include "config.h"
#include "syslog.h"
#include "gpio_mon.h"
#include "morse.h"
#include "tone.h"
#include "servo.h"
#include "nrf24l01.h"
#include "spi_bus.h"
#include "uart_pass.h"
#include "bt.h"
#include "device_detect.h"
#include "bench.h"
#include "heap_track.h"
#include "swarm.h"
#include "esp_heap_caps.h"
#include "shell.h"
#include "commands.h"
#include "kernel.h"

void cron_poll(void) {
}

static void cmd_usb(int argc, char *argv[]) { (void)argc; (void)argv; printf("usb: not implemented\n"); }
static void cmd_hid(int argc, char *argv[]) { (void)argc; (void)argv; printf("hid: not implemented\n"); }
static void cmd_console(int argc, char *argv[]) { (void)argc; (void)argv; printf("console: not implemented\n"); }
extern void cmd_imu(int argc, char *argv[]);

extern flash_config_t g_config;

static uint32_t s_cmd_count = 0;
static uint32_t s_unknown_count = 0;
static uint64_t s_boot_us;

static void print_uptime(void) {
    uint64_t us = hal_time_us();
    uint32_t s = (uint32_t)(us / 1000000);
    printf("%02luh %02lum %02lus", (unsigned long)(s / 3600), (unsigned long)((s % 3600) / 60), (unsigned long)(s % 60));
}

static void cmd_help(int argc, char *argv[]) {
    typedef struct { const char *name; const char *desc; } entry_t;
    typedef struct { const char *group; const entry_t *cmds; int count; } group_t;

    static const entry_t g_core[] = {
        {"help", "show this help"},
        {"version", "OS version and build info"},
        {"clear", "clear terminal screen"},
        {"echo", "echo <text>"},
        {"uptime", "time since boot"},
        {"sysinfo", "full system summary"},
        {"stats", "runtime statistics"},
        {"top", "live task monitor"},
    };
    static const entry_t g_hardware[] = {
        {"temp", "internal core temperature"},
        {"mem", "memory overview"},
        {"free", "heap allocator stats"},
        {"power", "VSYS voltage and battery estimate"},
        {"gpio", "read / write / mode / irq <pin>"},
        {"led", "on | off | toggle | blink [n]"},
        {"pwm", "pwm <pin> <duty 0-100> [freq_hz]"},
        {"adc", "raw ADC read (ch 0-2, GPIO26-28)"},
        {"avg", "averaged ADC read [samples]"},
        {"pull", "pull <pin> up | down | none"},
        {"pin", "snapshot of all GPIO states"},
        {"wdog", "watchdog status"},
        {"oled", "SSD1306 128x64 I2C display"},
        {"board", "ESP32 board info"},
        {"psram", "PSRAM size and free"},
    };
    static const entry_t g_buses[] = {
        {"i2c", "scan [sda scl] | read | write | dump"},
        {"spi", "init | write | read | xfer"},
        {"uart", "passthrough <baud> <tx> <rx> [timeout_s]"},
    };
    static const entry_t g_probes[] = {
        {"la", "logic analyser <pin> [samples] [us] [trigger]"},
        {"scope", "<pin> <hz> <ms> clean waveform viewer"},
        {"detect", "scan | uart <pin> | analyze <pin>"},
        {"imu", "MPU6050 read|stream|attitude|calibrate"},
    };
    static const entry_t g_servo[] = {
        {"servo", "<pin> <angle> | sweep | bg sweep/goto/stop"},
    };
    static const entry_t g_audio[] = {
        {"tone", "<pin> <note|Hz> [ms] passive buzzer"},
        {"melody", "<pin> <C4:200 E4:200 ...> | elise | canon"},
        {"morse", "<text> [wpm] blink LED in morse"},
        {"piano", "<pin> play buzzer from keyboard"},
    };
    static const entry_t g_scripting[] = {
        {"sleep", "sleep <ms>"},
        {"repeat", "repeat <n> <command>"},
        {"watch", "watch <ms> <command> run at interval"},
        {"trigger", "trigger <pin> <rise|fall|both> <cmd>"},
        {"cron", "cron <delay_ms> <command> deferred run"},
        {"bench", "bench <iters> <cmd> throughput test"},
        {"time", "time <cmd> measure execution time"},
        {"alias", "alias [name [cmd...]] define/list aliases"},
        {"unalias", "unalias <name> remove an alias"},
    };
    static const entry_t g_system[] = {
        {"reboot", "reboot via watchdog"},
        {"drivers", "list loaded drivers"},
        {"tasks", "list / enable / disable background tasks"},
        {"config", "show | set | save | reset"},
        {"syslog", "show | warn | err | write | clear | stats"},
        {"jobs", "list / cancel background jobs"},
        {"date", "[set Y M D h m s] real-time clock"},
        {"history", "[clear] command history"},
        {"uname", "[-a] system identity"},
        {"rand", "[min] [max] hardware random number"},
    };
    static const entry_t g_fs[] = {
        {"ls", "list directory [path]"},
        {"cat", "print file contents"},
        {"touch", "create / update file"},
        {"mkdir", "create directory"},
        {"rm", "rm [-r] <path> remove file or dir"},
        {"write", "overwrite file with text"},
        {"append", "append text to file"},
        {"hexdump", "hex + ASCII dump"},
        {"cd", "change directory"},
        {"pwd", "print working directory"},
        {"cp", "cp <src> <dst>"},
        {"mv", "mv <src> <dst> move / rename"},
        {"stat", "file / dir metadata"},
        {"wc", "count lines, words, bytes"},
        {"grep", "grep <pattern> <file>"},
        {"find", "recursive name search"},
        {"df", "filesystem usage summary"},
        {"tree", "print directory tree"},
    };
    static const entry_t g_bluetooth[] = {
        {"bt init", "init Bluetooth (SPP)"},
        {"bt deinit", "power down Bluetooth"},
        {"bt status", "show connection state"},
        {"bt shell", "interactive BT shell"},
    };
    static const entry_t g_wifi[] = {
        {"wifi init", "init WiFi subsystem"},
        {"wifi ap <ssid> [pass]", "start softAP mode"},
        {"wifi scan", "scan for networks"},
        {"wifi join <ssid> <pass>", "connect to network"},
        {"wifi disconnect", "disconnect from network"},
        {"wifi status", "show connection state"},
        {"wifi get <url>", "HTTP GET request"},
        {"wifi post <url> <body>", "HTTP POST request"},
    };
    static const entry_t g_camera[] = {
        {"camera init", "initialise the camera"},
        {"camera capture", "capture and dump JPEG info"},
        {"camera save [path]", "save capture to SPIFFS"},
        {"camera ls", "list saved captures"},
        {"camera info", "show camera info"},
        {"camera res", "set resolution"},
        {"camera quality", "set JPEG quality"},
        {"camera stream", "start/stop MJPEG stream"},
    };
    static const entry_t g_swarm[] = {
        {"swarm init", "start ESP-NOW mesh"},
        {"swarm id <name>", "set this node's name"},
        {"swarm mac", "show this node's MAC"},
        {"swarm peer <MAC>", "register a peer node"},
        {"swarm pub", "broadcast position telemetry"},
        {"swarm list", "show all known peers"},
        {"swarm stop", "stop the mesh"},
    };
    static const entry_t g_nrf24[] = {
        {"nrf24 init", "init NRF24L01+ on SPI"},
        {"nrf24 send", "transmit data"},
        {"nrf24 listen", "receive mode"},
        {"nrf24 status", "show registers"},
    };
    static const entry_t g_usb[] = {
        {"usb", "status|list|export|import|sync|rm|format USB mass-storage disk"},
        {"hid", "type <text>|line <text>|key <COMBO>|enter act as USB keyboard"},
        {"console", "oled on|off mirror shell output to the OLED (handheld mode)"},
    };

#define COUNT(a) (int)(sizeof(a) / sizeof((a)[0]))
    static const group_t groups[] = {
        {"core",       g_core,     COUNT(g_core)},
        {"hardware",   g_hardware, COUNT(g_hardware)},
        {"buses",      g_buses,    COUNT(g_buses)},
        {"probes",     g_probes,   COUNT(g_probes)},
        {"servo",      g_servo,    COUNT(g_servo)},
        {"audio",      g_audio,    COUNT(g_audio)},
        {"scripting",  g_scripting,COUNT(g_scripting)},
        {"system",     g_system,   COUNT(g_system)},
        {"filesystem", g_fs,       COUNT(g_fs)},
        {"bluetooth",  g_bluetooth,COUNT(g_bluetooth)},
        {"wifi",       g_wifi,     COUNT(g_wifi)},
        {"swarm",      g_swarm,    COUNT(g_swarm)},
        {"camera",     g_camera,   COUNT(g_camera)},
        {"nrf24",      g_nrf24,    COUNT(g_nrf24)},
        {"usb",        g_usb,      COUNT(g_usb)},
    };
#undef COUNT

