enginestein/DeckOS_ESP32/main/commands/commands.c
    static const int group_count = (int)(sizeof(groups) / sizeof(group_t));
    static const int NAME_COL = 22;

    if (argc > 1) {
        const char *wanted = argv[1];
        for (int g = 0; g < group_count; g++) {
            if (strcmp(wanted, groups[g].group) == 0) {
                printf("\n[%s]\n", groups[g].group);
                printf("----------------------------------------------------\n");
                fflush(stdout);
                for (int i = 0; i < groups[g].count; i++)
                    printf("  %-*s %s\n", NAME_COL, groups[g].cmds[i].name, groups[g].cmds[i].desc);
                printf("----------------------------------------------------\n");
                fflush(stdout);
                return;
            }
        }
        printf("unknown help group: %s\n", wanted);
        fflush(stdout);
        return;
    }

    printf("DeckOS v6.0  --  command groups\n");
    printf("====================================================\n\n");
    fflush(stdout);
    for (int g = 0; g < group_count; g++)
        printf("  %-20s help %s\n", groups[g].group, groups[g].group);
    printf("\n----------------------------------------------------\n");
    printf("example: help core\n");
    fflush(stdout);
}

static void cmd_version(int argc, char *argv[]) {
    (void)argc; (void)argv;
    const board_info_t *b = board_detect();
    printf("DeckOS v6.0  |  %s\n", b->name);
    printf("Build: %s %s\n", __DATE__, __TIME__);
}

static void cmd_clear(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("\033[2J\033[H");
}

static void cmd_echo(int argc, char *argv[]) {
    for (int i = 1; i < argc; i++)
        printf("%s%s", argv[i], (i < argc - 1) ? " " : "");
    printf("\n");
}

static void cmd_uptime(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("uptime: ");
    print_uptime();
    printf("\n");
}

static void cmd_temp(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("core temp: N/A (ESP32 temp sensor not exposed via HAL)\n");
    fflush(stdout);
}

static void cmd_mem(int argc, char *argv[]) {
    (void)argc; (void)argv;
    const board_info_t *b = board_detect();
    printf("total flash : %lu KB\n", b->flash_kb);
    printf("PSRAM      : %s\n", b->has_psram ? "yes" : "no");
    printf("SD card    : %s\n", b->has_sdcard ? "yes" : "no");
    printf("camera     : %s\n", b->has_camera ? "yes" : "no");
    fflush(stdout);
}

static void cmd_wdog(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("watchdog: ESP32 auto-reboots on hang\n");
    printf("last reboot cause: check ESP32 RTC reset reason\n");
}

static void cmd_pin(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("GPIO state snapshot:\n");
    printf("PIN  DIR  VAL\n");
    fflush(stdout);
    for (int i = 0; i <= 39; i++) {
        hal_gpio_init(i);
        int val = hal_gpio_get(i);
        printf(" %-3d  %-4s  %d\n", i, "IN", val);
    }
    fflush(stdout);
}


static void argv_join(char *buf, int buflen, int argc, char *argv[], int start) {
    buf[0] = '\0';
    for (int i = start; i < argc; i++) {
        if (i > start) strncat(buf, " ", (size_t)(buflen - 1) - strlen(buf));
        strncat(buf, argv[i], (size_t)(buflen - 1) - strlen(buf));
    }
    int len = (int)strlen(buf);
    if (len >= 2 && buf[0] == '"' && buf[len - 1] == '"') {
        memmove(buf, buf + 1, (size_t)(len - 2));
        buf[len - 2] = '\0';
    }
}

static void cmd_ls(int argc, char *argv[]) {
    vfs_ls(argc >= 2 ? argv[1] : ".");
}

static void cmd_cat(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: cat <file> [file2 ...]\n"); return; }
    for (int a = 1; a < argc; a++) {
        if (argc > 2) printf("==> %s <==\n", argv[a]);
        vfs_cat(argv[a]);
    }
}

static void cmd_touch(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: touch <file> [file2 ...]\n"); return; }
    bool changed = false;
    for (int a = 1; a < argc; a++) {
        if (vfs_touch(argv[a]) >= 0) { printf("touched '%s'\n", argv[a]); changed = true; }
    }
    if (changed) vfs_save();
}

static void cmd_mkdir(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: mkdir <dir> [dir2 ...]\n"); return; }
    bool changed = false;
    for (int a = 1; a < argc; a++) {
        if (vfs_mkdir(argv[a]) >= 0) { printf("created dir '%s'\n", argv[a]); changed = true; }
    }
    if (changed) vfs_save();
}

static void cmd_rm(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: rm [-r] <path> [path2 ...]\n"); return; }
    bool recursive = false;
    int start = 1;
    if (strcmp(argv[1], "-r") == 0) { recursive = true; start = 2; }
    if (start >= argc) { printf("rm: missing path argument\n"); return; }
    bool changed = false;
    for (int a = start; a < argc; a++) {
        if (vfs_rm(argv[a], recursive) == 0) { printf("removed '%s'\n", argv[a]); changed = true; }
    }
    if (changed) vfs_save();
}

static bool interactive_write(const char *path) {
    printf("iwrite: writing to '%s'\n", path);
    printf("  paste or type content; end with '.' on its own line.\n");
    printf("  type '.abort' to cancel.\n");
    printf("---\n");
    bool first_line = true;
    int total = 0;
    while (true) {
        char line[SCRIPT_LINE_LEN];
        int lpos = 0;
        bool line_done = false;
        while (!line_done && lpos < (int)(sizeof(line) - 1)) {
            int c = hal_console_getchar();
            if (c < 0) { kernel_poll(); hal_sleep_ms(1); continue; }
            if (c == '\r' || c == '\n') {
                putchar('\n');
                fflush(stdout);
                line_done = true;
            } else if (c == 3) {
                printf("\niwrite: cancelled\n");
                return false;
            } else if ((c == 127 || c == '\b') && lpos > 0) {
                lpos--;
                printf("\b \b");
                fflush(stdout);
            } else if (c >= 32 && c < 127) {
                line[lpos++] = (char)c;
                putchar(c);
                fflush(stdout);
            }
        }
        line[lpos] = '\0';
        if (strcmp(line, ".") == 0) break;
        if (strcmp(line, ".abort") == 0) {
            printf("iwrite: aborted -- nothing written\n");
            return false;
        }
        uint8_t wbuf[SCRIPT_LINE_LEN + 1];
        memcpy(wbuf, line, (size_t)lpos);
        wbuf[lpos] = '\n';
        int n = vfs_write(path, wbuf, (uint32_t)(lpos + 1), !first_line);
        if (n < 0) { printf("iwrite: write error on '%s'\n", path); return false; }
        total += lpos + 1;
        first_line = false;
    }
    if (total == 0) { printf("iwrite: empty content -- nothing written\n"); return false; }
    printf("---\niwrite: saved %d bytes to '%s'\n", total, path);
    return true;
}

