enginestein/DeckOS_ESP32/main/commands/commands.c
static void cmd_write(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  write <file> <content...>    overwrite file with one line of text\n");
        printf("  write -i <file>              interactive multi-line write (end with '.')\n");
        return;
    }
    if (strcmp(argv[1], "-i") == 0) {
        if (argc < 3) { printf("write -i: missing filename\n"); return; }
        if (interactive_write(argv[2])) vfs_save();
        return;
    }
    if (argc < 3) {
        printf("usage: write <file> <content...>\n");
        printf("       use 'write -i <file>' for multi-line interactive input\n");
        return;
    }
    char content[VFS_MAX_FILE_SIZE];
    argv_join(content, sizeof(content), argc, argv, 2);
    int clen = (int)strlen(content);
    if (clen < (int)sizeof(content) - 1) { content[clen] = '\n'; content[clen + 1] = '\0'; }
    int n = vfs_write(argv[1], (const uint8_t *)content, (uint32_t)strlen(content), false);
    if (n >= 0) { printf("wrote %d B to '%s'\n", n, argv[1]); vfs_save(); }
}

static void cmd_iwrite(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage: iwrite <file>\n");
        printf("  Enter or paste lines, then type '.' alone to save.\n");
        printf("  Type '.abort' to cancel.\n");
        return;
    }
    if (interactive_write(argv[1])) vfs_save();
}

static void cmd_append(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: append <file> <content...>\n"); return; }
    char content[VFS_MAX_FILE_SIZE];
    argv_join(content, sizeof(content), argc, argv, 2);
    int clen = (int)strlen(content);
    if (clen < VFS_MAX_FILE_SIZE - 1) { content[clen] = '\n'; content[clen + 1] = '\0'; }
    int n = vfs_write(argv[1], (const uint8_t *)content, (uint32_t)strlen(content), true);
    if (n >= 0) { printf("appended %d B to '%s'\n", n, argv[1]); vfs_save(); }
}

static void cmd_hexdump(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: hexdump <file>\n"); return; }
    vfs_hexdump(argv[1]);
}

static void cmd_cd(int argc, char *argv[]) {
    const char *path = (argc >= 2) ? argv[1] : "/";
    if (vfs_cd(path)) printf("%s\n", vfs_cwd_path());
}

static void cmd_pwd(int argc, char *argv[]) {
    (void)argc; (void)argv;
    vfs_pwd();
}

static void cmd_cp(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: cp <src> <dst>\n"); return; }
    if (vfs_cp(argv[1], argv[2]) == 0) vfs_save();
}

static void cmd_mv(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: mv <src> <dst>\n"); return; }
    if (vfs_mv(argv[1], argv[2]) == 0) vfs_save();
}

static void cmd_stat(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: stat <path>\n"); return; }
    for (int a = 1; a < argc; a++) {
        if (argc > 2) printf("==> %s\n", argv[a]);
        vfs_stat(argv[a]);
    }
}

static void cmd_wc(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: wc <file> [file2 ...]\n"); return; }
    for (int a = 1; a < argc; a++) vfs_wc(argv[a]);
}

static void cmd_grep(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: grep <pattern> <file>\n"); return; }
    vfs_grep(argv[2], argv[1]);
}

static void cmd_find(int argc, char *argv[]) {
    const char *name = (argc >= 2) ? argv[1] : "";
    vfs_find_all(name);
}

static void cmd_df(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("=== VFS disk usage ===\n");
    vfs_df();
    printf("======================\n");
}

static void cmd_tree(int argc, char *argv[]) {
    (void)argc; (void)argv;
    vfs_tree();
}

static void cmd_pwm(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: pwm <pin> <duty 0-100> [freq_hz]\n"); return; }
    int pin = atoi(argv[1]);
    int duty = atoi(argv[2]);
    int freq = (argc >= 4) ? atoi(argv[3]) : 1000;
    if (duty < 0 || duty > 100) { printf("duty must be 0-100\n"); return; }
    if (freq < 1 || freq > 40000000) { printf("freq must be 1-40000000 Hz\n"); return; }
    hal_pwm_init(pin);
    hal_pwm_set_duty(pin, (float)duty, (uint32_t)freq);
    printf("PWM on GPIO%-2d  duty=%d%%  freq=%d Hz\n", pin, duty, freq);
}

static void cmd_pull(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: pull <pin> <up|down|none>\n"); return; }
    int pin = atoi(argv[1]);
    hal_gpio_init(pin);
    if (strcmp(argv[2], "up") == 0) {
        hal_gpio_set_pull(pin, true, false);
        printf("GPIO%d pull-up\n", pin);
    } else if (strcmp(argv[2], "down") == 0) {
        hal_gpio_set_pull(pin, false, true);
        printf("GPIO%d pull-down\n", pin);
    } else if (strcmp(argv[2], "none") == 0) {
        hal_gpio_set_pull(pin, false, false);
        printf("GPIO%d pulls disabled\n", pin);
    } else printf("unknown: %s\n", argv[2]);
}

static void cmd_led(int argc, char *argv[]) {
    const board_info_t *b = board_detect();
    int led_pin = b->led_pin;
    static bool led_state = false;
    hal_gpio_init(led_pin);
    hal_gpio_set_dir(led_pin, true);
    if (argc < 2) { printf("usage: led <on|off|toggle|blink [n]>\n"); return; }
    if (strcmp(argv[1], "on") == 0) {
        led_state = true;
        hal_gpio_put(led_pin, 1);
        printf("LED on\n");
    } else if (strcmp(argv[1], "off") == 0) {
        led_state = false;
        hal_gpio_put(led_pin, 0);
        printf("LED off\n");
    } else if (strcmp(argv[1], "toggle") == 0) {
        led_state = !led_state;
        hal_gpio_put(led_pin, led_state);
        printf("LED %s\n", led_state ? "on" : "off");
    } else if (strcmp(argv[1], "blink") == 0) {
        int n = (argc >= 3) ? atoi(argv[2]) : 5;
        if (n < 1 || n > 50) { printf("count 1-50\n"); return; }
        for (int i = 0; i < n; i++) {
            hal_gpio_put(led_pin, 1);
            hal_sleep_ms(150);
            hal_gpio_put(led_pin, 0);
            hal_sleep_ms(150);
        }
        printf("blinked %d times\n", n);
    } else printf("unknown led subcommand: %s\n", argv[1]);
}

static void cmd_gpio(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: gpio <read|write|mode|irq> <pin> [val]\n"); return; }

    if (strcmp(argv[1], "irq") == 0) {
        int pin = atoi(argv[2]);
        if (argc >= 4 && strcmp(argv[3], "stop") == 0) {
            gpio_mon_stop((uint8_t)pin);
            printf("stopped IRQ monitor on GPIO%d\n", pin);
        } else if (argc >= 4 && strcmp(argv[3], "dump") == 0) {
            gpio_mon_dump((uint8_t)pin);
        } else {
            uint32_t timeout_s = (argc >= 4) ? (uint32_t)atoi(argv[3]) : 30;
            gpio_mon_start((uint8_t)pin, timeout_s);
        }
        return;
    }

    int pin = atoi(argv[2]);

    if (strcmp(argv[1], "read") == 0) {
        hal_gpio_init(pin);
        hal_gpio_set_dir(pin, false);
        printf("GPIO%-2d = %d\n", pin, hal_gpio_get(pin));
    } else if (strcmp(argv[1], "write") == 0) {
        if (argc < 4) { printf("usage: gpio write <pin> <0|1>\n"); return; }
        int val = atoi(argv[3]);
        hal_gpio_init(pin);
        hal_gpio_set_dir(pin, true);
        hal_gpio_put(pin, val ? 1 : 0);
        printf("GPIO%-2d <- %d\n", pin, val ? 1 : 0);
    } else if (strcmp(argv[1], "mode") == 0) {
        if (argc < 4) { printf("usage: gpio mode <pin> <in|out>\n"); return; }
        hal_gpio_init(pin);
        if (strcmp(argv[3], "in") == 0) {
            hal_gpio_set_dir(pin, false);
            printf("GPIO%-2d -> INPUT\n", pin);
        } else if (strcmp(argv[3], "out") == 0) {
            hal_gpio_set_dir(pin, true);
            printf("GPIO%-2d -> OUTPUT\n", pin);
        } else printf("unknown mode: %s\n", argv[3]);
    } else {
        printf("unknown gpio subcommand: %s\n", argv[1]);
    }
}

static void cmd_adc(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: adc <0|1|2>  (GPIO26-28)\n"); fflush(stdout); return; }
    int ch = atoi(argv[1]);
    if (ch < 0 || ch > 2) { printf("channel must be 0-2\n"); fflush(stdout); return; }
    hal_adc_init();
    hal_adc_select_input((uint)ch);
    uint16_t raw = hal_adc_read();
    float voltage = raw * 3.3f / 4095.0f;
    printf("ADC%d  raw=%4d  voltage=%.3f V\n", ch, raw, voltage);
    fflush(stdout);
}

