enginestein/DeckOS_ESP32/main/commands/commands.c
static void cmd_avg(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: avg <adc_ch 0-2> [samples 1-256]\n"); fflush(stdout); return; }
    int ch = atoi(argv[1]);
    if (ch < 0 || ch > 2) { printf("channel must be 0-2\n"); fflush(stdout); return; }
    int samples = (argc >= 3) ? atoi(argv[2]) : 64;
    if (samples < 1 || samples > 256) { printf("samples: 1-256\n"); fflush(stdout); return; }

    hal_adc_init();
    hal_adc_select_input((uint)ch);
    uint32_t sum = 0;
    uint16_t mn = 0xFFFF, mx = 0;
    for (int i = 0; i < samples; i++) {
        uint16_t r = hal_adc_read();
        sum += r;
        if (r < mn) mn = r;
        if (r > mx) mx = r;
    }
    uint16_t avg_raw = (uint16_t)(sum / samples);
    float voltage = avg_raw * 3.3f / 4095.0f;
    printf("ADC%d  samples=%d\n", ch, samples);
    printf("  avg  : %4d  /  %.3f V\n", avg_raw, voltage);
    printf("  min  : %4d  /  %.3f V\n", mn, mn * 3.3f / 4095.0f);
    printf("  max  : %4d  /  %.3f V\n", mx, mx * 3.3f / 4095.0f);
    printf("  noise: %4d  counts p-p\n", mx - mn);
    fflush(stdout);
}

static void cmd_i2c(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  i2c scan [sda] [scl]              - scan bus (default GP21 GP22)\n");
        printf("  i2c read  <addr> <reg> [sda] [scl]\n");
        printf("  i2c write <addr> <reg> <val> [sda] [scl]\n");
        printf("  i2c dump  <addr> [sda] [scl]      - dump 256 registers\n");
        return;
    }

    uint sda, scl;
    if (argc >= 4 && isdigit((unsigned char)argv[argc-2][0]) && isdigit((unsigned char)argv[argc-1][0])) {
        scl = (uint)atoi(argv[argc-1]);
        sda = (uint)atoi(argv[argc-2]);
    } else {
        const board_info_t *b = board_detect();
        sda = b->default_i2c_sda;
        scl = b->default_i2c_scl;
    }

    if (strcmp(argv[1], "scan") == 0) {
        hal_i2c_init(sda, scl, 100000);
        printf("I2C scan (SDA=GP%u SCL=GP%u):\n", sda, scl);
        printf("     0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F\n");
        int found = 0;
        for (int row = 0; row < 8; row++) {
            char line[64];
            int pos = 0;
            pos += snprintf(line + pos, sizeof(line) - pos, "%02X: ", row * 16);
            for (int col = 0; col < 16; col++) {
                uint8_t addr = (uint8_t)(row * 16 + col);
                uint8_t rxdata;
                if (hal_i2c_read(addr, &rxdata, 1) >= 0) {
                    pos += snprintf(line + pos, sizeof(line) - pos, "%02X ", addr);
                    found++;
                } else {
                    pos += snprintf(line + pos, sizeof(line) - pos, "-- ");
                }
            }
            print_lock_acquire();
            printf("%s\n", line);
            print_lock_release();
        }
        print_lock_acquire();
        printf("%d device(s) found\n", found);
        print_lock_release();
    } else if (strcmp(argv[1], "read") == 0) {
        if (argc < 4) { printf("usage: i2c read <addr_hex> <reg_hex> [sda] [scl]\n"); return; }
        uint8_t addr = (uint8_t)strtol(argv[2], NULL, 16);
        uint8_t reg = (uint8_t)strtol(argv[3], NULL, 16);
        hal_i2c_init(sda, scl, 100000);
        uint8_t val = 0;
                int ret = hal_i2c_write_read(addr, (const uint8_t*)&reg, 1, &val, 1);
        if (ret < 0) { printf("I2C error (no ACK?)\n"); return; }
        printf("0x%02X reg[0x%02X] = 0x%02X (%d)\n", addr, reg, val, val);
    } else if (strcmp(argv[1], "write") == 0) {
        if (argc < 5) { printf("usage: i2c write <addr_hex> <reg_hex> <val_hex> [sda] [scl]\n"); return; }
        uint8_t addr = (uint8_t)strtol(argv[2], NULL, 16);
        uint8_t reg = (uint8_t)strtol(argv[3], NULL, 16);
        uint8_t val = (uint8_t)strtol(argv[4], NULL, 16);
        hal_i2c_init(sda, scl, 100000);
        uint8_t buf[2] = {reg, val};
        int ret = hal_i2c_write(addr, buf, 2);
        if (ret < 0) { printf("I2C write failed\n"); return; }
        printf("wrote 0x%02X -> 0x%02X[0x%02X]\n", val, addr, reg);
    } else if (strcmp(argv[1], "dump") == 0) {
        if (argc < 3) { printf("usage: i2c dump <addr_hex> [sda] [scl]\n"); return; }
        uint8_t addr = (uint8_t)strtol(argv[2], NULL, 16);
        hal_i2c_init(sda, scl, 100000);
        printf("Dumping I2C device 0x%02X\n", addr);
        printf("     00 01 02 03 04 05 06 07 08 09 0A 0B 0C 0D 0E 0F\n");
        for (int row = 0; row < 16; row++) {
            printf("%02X: ", row * 16);
            for (int col = 0; col < 16; col++) {
                uint8_t reg = (uint8_t)(row * 16 + col);
                uint8_t val = 0;
        int ret = hal_i2c_write_read(addr, (const uint8_t*)&reg, 1, &val, 1);
                if (ret < 0) printf("-- ");
                else printf("%02X ", val);
            }
            printf("\n");
        }
    } else {
        printf("unknown i2c subcommand: %s\n", argv[1]);
    }
}

static void cmd_oled(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  oled init [sda] [scl]          init display\n");
        printf("  oled on                        turn on display\n");
        printf("  oled off                       turn off display\n");
        printf("  oled clear                     clear screen\n");
        printf("  oled text <x> <y> \"text\"       draw text\n");
        printf("  oled line <x0> <y0> <x1> <y1>  draw line\n");
        printf("  oled rect <x> <y> <w> <h>      draw rect outline\n");
        printf("  oled fill <x> <y> <w> <h>      filled rect\n");
        printf("  oled pixel <x> <y> <0|1>       set pixel\n");
        printf("  oled frame <x> <y> <w> <h>     thick border\n");
        printf("  oled inv                       invert display\n");
        printf("  oled scroll <h|v|hv|stop>\n");
        printf("  oled char <c> [0-3 scale]      draw large char\n");
        printf("  oled image <x> <y>             128x64 raw image\n");
        printf("  oled logo                      DeckOS logo\n");
        printf("  oled demo                      various demos\n");
        return;
    }
    if (strcmp(argv[1], "init") == 0) {
        uint sda = (argc >= 3) ? (uint)atoi(argv[2]) : 21;
        uint scl = (argc >= 4) ? (uint)atoi(argv[3]) : 22;
        oled_init(sda, scl);
        printf("OLED init SDA=GP%u SCL=GP%u\n", sda, scl);
    } else if (strcmp(argv[1], "on") == 0) {
        oled_on();
    } else if (strcmp(argv[1], "off") == 0) {
        oled_off();
    } else if (strcmp(argv[1], "clear") == 0) {
        oled_clear();
    } else if (strcmp(argv[1], "text") == 0 || strcmp(argv[1], "string") == 0) {
        if (argc < 5) { printf("usage: oled text <x> <y> \"text\"\n"); return; }
        int x = atoi(argv[2]), y = atoi(argv[3]);
        oled_text(x, y, argv[4]);
    } else if (strcmp(argv[1], "pixel") == 0) {
        if (argc < 5) { printf("usage: oled pixel <x> <y> <0|1>\n"); return; }
        oled_pixel(atoi(argv[2]), atoi(argv[3]), atoi(argv[4]) ? 1 : 0);
    } else if (strcmp(argv[1], "inv") == 0) {
        oled_invert(true);
    } else if (strcmp(argv[1], "display") == 0) {
        oled_display();
    } else { printf("unavailable oled subcommand: %s\n", argv[1]); return; }
}

static void cmd_spi(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  spi init <miso> <mosi> <sck> <baud> <mode>  - init bus\n");
        printf("  spi write <cs> <hex bytes...>               - write bytes\n");
        printf("  spi read  <cs> <count>                      - read bytes\n");
        printf("  spi xfer  <cs> <hex bytes...>               - full duplex\n");
        return;
    }

    if (argc >= 3 && strcmp(argv[1], "init") == 0) {
        if (argc < 7) { printf("usage: spi init <miso> <mosi> <sck> <baud> <mode>\n"); return; }
        int miso = atoi(argv[2]), mosi = atoi(argv[3]), sck = atoi(argv[4]);
        int baud = atoi(argv[5]), mode = atoi(argv[6]);
        hal_spi_t spibus = hal_spi_init((uint)sck, (uint)mosi, (uint)miso, (uint)baud);
        if (spibus == NULL) { printf("SPI init failed\n"); return; }
        printf("SPI initted: MISO=GP%d MOSI=GP%d SCK=GP%d baud=%d mode=%d\n", miso, mosi, sck, baud, mode);
    } else if (argc >= 3 && strcmp(argv[1], "write") == 0) {
        int cs = atoi(argv[2]);
        uint8_t data[128]; int dlen = 0;
        for (int a = 3; a < argc && dlen < 128; a++) {
            unsigned long v = strtoul(argv[a], NULL, 16);
            if (v > 0xFF) { printf("byte value 0-255\n"); return; }
            data[dlen++] = (uint8_t)v;
        }
        hal_spi_init(0, 0, 0, 0);
        spi_bus_transfer(cs, data, NULL, dlen);
        printf("SPI wrote %d bytes to CS=%d\n", dlen, cs);
    } else if (argc >= 3 && strcmp(argv[1], "read") == 0) {
        int cs = atoi(argv[2]);
        int count = (argc >= 4) ? atoi(argv[3]) : 8;
        if (count > 256) count = 256;
        uint8_t tx[256]; memset(tx, 0xFF, count);
        uint8_t rx[256];
        hal_spi_init(0, 0, 0, 0);
        spi_bus_transfer(cs, tx, rx, count);
        printf("SPI read %d bytes from CS=%d:\n", count, cs);
        for (int i = 0; i < count; i++) {
            printf("%02X ", rx[i]);
            if ((i + 1) % 16 == 0) printf("\n");
        }
        if (count % 16) printf("\n");
    } else if (argc >= 3 && strcmp(argv[1], "xfer") == 0) {
        int cs = atoi(argv[2]);
        uint8_t tx[128]; int dlen = 0;
        for (int a = 3; a < argc && dlen < 128; a++) {
            unsigned long v = strtoul(argv[a], NULL, 16);
            if (v > 0xFF) { printf("byte value 0-255\n"); return; }
            tx[dlen++] = (uint8_t)v;
        }
        uint8_t rx[128];
        hal_spi_init(0, 0, 0, 0);
        spi_bus_transfer(cs, tx, rx, dlen);
        printf("SPI xfer %d bytes:\n", dlen);
        for (int i = 0; i < dlen; i++) printf("%02X ", rx[i]);
        printf("\n");
    } else printf("unknown spi subcommand: %s\n", argv[1]);
}

static void cmd_servo(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  servo <pin> <angle_deg>         -- set servo angle\n");
        printf("  servo sweep <pin> [from] [to] [ms] -- sweep 0-180\n");
        printf("  servo bg add <pin> [name]        -- register bg servo\n");
        printf("  servo bg sweep <slot> [min] [max] [step] [ms]\n");
        printf("  servo bg goto <slot> <angle> [ms]\n");
        printf("  servo bg stop <slot>\n");
        printf("  servo bg list\n");
        return;
    }

    if (strcmp(argv[1], "sweep") == 0) {
        int pin = (argc >= 3) ? atoi(argv[2]) : -1;
        if (pin < 0) { printf("usage: servo sweep <pin> [from] [to] [step_ms]\n"); return; }
        int from = (argc >= 4) ? atoi(argv[3]) : 0;
        int to   = (argc >= 5) ? atoi(argv[4]) : 180;
        int ms   = (argc >= 6) ? atoi(argv[5]) : 20;
        servo_sweep_blocking((uint8_t)pin, from, to, ms);
    } else if (argc >= 2 && strcmp(argv[1], "bg") == 0) {
        if (argc < 3) { printf("usage: servo bg <add|sweep|goto|stop|list>\n"); return; }
        if (strcmp(argv[2], "add") == 0) {
            int pin = (argc >= 4) ? atoi(argv[3]) : -1;
            if (pin < 0) { printf("need pin\n"); return; }
            const char *name = (argc >= 5) ? argv[4] : NULL;
            int slot = servo_bg_add((uint8_t)pin, name);
            if (slot >= 0) printf("servo bg added: slot %d, GP%d\n", slot, pin);
        } else if (strcmp(argv[2], "sweep") == 0) {
            if (argc < 4) { printf("usage: servo bg sweep <slot> [min] [max] [step_deg] [step_ms]\n"); return; }
            int slot = atoi(argv[3]);
            int minv = (argc >= 5) ? atoi(argv[4]) : 0;
            int maxv = (argc >= 6) ? atoi(argv[5]) : 180;
            int step = (argc >= 7) ? atoi(argv[6]) : 1;
            int ms   = (argc >= 8) ? atoi(argv[7]) : 20;
            servo_bg_set_sweep(slot, minv, maxv, step, (uint32_t)ms);
            printf("servo slot %d sweep set %d-%d step %d every %d ms\n", slot, minv, maxv, step, ms);
        } else if (strcmp(argv[2], "goto") == 0) {
            if (argc < 5) { printf("usage: servo bg goto <slot> <angle> [step_ms]\n"); return; }
            int slot = atoi(argv[3]), angle = atoi(argv[4]);
            int ms   = (argc >= 6) ? atoi(argv[5]) : 20;
            servo_bg_set_goto(slot, angle, (uint32_t)ms);
            printf("servo slot %d goto %d deg\n", slot, angle);
        } else if (strcmp(argv[2], "stop") == 0) {
            if (argc < 4) { printf("usage: servo bg stop <slot>\n"); return; }
            int slot = atoi(argv[3]);
            servo_bg_stop(slot);
            printf("servo slot %d stopped\n", slot);
        } else if (strcmp(argv[2], "list") == 0) {
            servo_bg_list();
        } else printf("unknown bg subcommand: %s\n", argv[2]);
    } else {
        int pin = atoi(argv[1]);
        int angle = (argc >= 3) ? atoi(argv[2]) : 90;
        int ret = servo_set(pin, angle);
        if (ret >= 0) printf("Servo GP%d set to %d deg\n", pin, angle);
        else printf("Servo error on GP%d\n", pin);
    }
}

