enginestein/DeckOS_ESP32/main/commands/commands.c
static void cmd_tone(int argc, char *argv[]) {
    if (argc < 3) {
        printf("usage: tone <pin> <note|Hz> [duration_ms]\n");
        printf("Notes: C4 D4 E4 F4 G4 A4 B4 C5 ... (or Hz like 440)\n");
        return;
    }
    int pin = atoi(argv[1]);
    const char *note_or_hz = argv[2];
    int ms = (argc >= 4) ? atoi(argv[3]) : 500;
    if (ms > 30000) ms = 30000;

    if (isdigit((unsigned char)note_or_hz[0])) {
        int hz = atoi(note_or_hz);
        if (hz < 20 || hz > 20000) { printf("Hz out of range (20-20000)\n"); return; }
        tone_play_hz(pin, (uint)hz, (uint)ms);
        printf("Tone %d Hz on GP%d for %d ms\n", hz, pin, ms);
    } else {
        tone_play(pin, note_or_hz, (uint)ms);
        printf("Note %s on GP%d for %d ms\n", note_or_hz, pin, ms);
    }
}

static const char *twinkle[] = {"C4:200","C4:200","G4:200","G4:200","A4:200","A4:200","G4:400",
    "F4:200","F4:200","E4:200","E4:200","D4:200","D4:200","C4:400",NULL};
static const char *elise[] = {"E5:150","Eb5:150","E5:150","Eb5:150","E5:150","B4:150","D5:150",
    "C5:150","A4:600",NULL};
static const char *canon_str[] = {"C4:300","G3:300","A3:300","E3:300","F3:300","C3:300",
    "F3:300","G3:300",NULL};

static void cmd_melody(int argc, char *argv[]) {
    if (argc < 3) {
        printf("usage: melody <pin> <C4:200 E4:200 ...> | elise | canon\n");
        return;
    }
    int pin = atoi(argv[1]);
    const char **seq = NULL;

    if (argc == 3) {
        if (strcmp(argv[2], "elise") == 0) seq = elise;
        else if (strcmp(argv[2], "canon") == 0) seq = canon_str;
        else if (strcmp(argv[2], "twinkle") == 0) seq = twinkle;
    }

    if (seq) {
        int ticks = 0;
        for (int i = 0; seq[i]; i++) {
            char buf[32];
            strncpy(buf, seq[i], sizeof(buf) - 1);
            buf[sizeof(buf) - 1] = '\0';
            char *colon = strchr(buf, ':');
            if (!colon) continue;
            *colon++ = '\0';
            int ms = atoi(colon);
            tone_play(pin, buf, (uint)ms);
            hal_sleep_ms((uint)ms + 30);
            ticks += ms + 30;
        }
        printf("Melody complete (%d ms)\n", ticks);
        return;
    }

    for (int a = 2; a < argc; a++) {
        char buf[32];
        strncpy(buf, argv[a], sizeof(buf) - 1);
        buf[sizeof(buf) - 1] = '\0';
        char *colon = strchr(buf, ':');
        if (!colon) { printf("bad note format: %s (expect C4:200)\n", argv[a]); continue; }
        *colon++ = '\0';
        int ms = atoi(colon);
        if (ms < 10) ms = 200;
        tone_play(pin, buf, (uint)ms);
        hal_sleep_ms((uint)ms + 20);
    }
}

static void cmd_morse(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage: morse <text> [wpm]\n");
        return;
    }
    int wpm = (argc >= 3) ? atoi(argv[2]) : 8;
    if (wpm < 3 || wpm > 40) { printf("wpm: 3-40\n"); return; }
    const board_info_t *b = board_detect();
    int pin = b->led_pin;
    (void)pin;
    morse_send(argv[1], wpm, pin);
    printf("Morse: %s (%d wpm)\n", argv[1], wpm);
}

static void cmd_piano(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: piano <pin>\n"); return; }
    int pin = atoi(argv[1]);
    printf("Piano mode on GP%d\n", pin);
    printf("Press keys on keyboard to play notes.\n");
    printf("Lower row: C D E F G A B (C4-B4)\n");
    printf("Upper row: W E   T Y U (sharps)\n");
    printf("Press Q to quit.\n");

    static const char *notes[] = {"C4","C#4","D4","D#4","E4","F4","F#4","G4","G#4","A4","A#4","B4"};
    static const char keymap[] = {
        'a','w','s','e','d','f','t','g','y','h','u','j',0};
    int prev_note = -1;

    while (true) {
        kernel_poll();
        int c = hal_console_getchar();
        if (c < 0) { hal_sleep_ms(10); continue; }
        if (c == 'q' || c == 'Q') break;
        for (int i = 0; keymap[i]; i++) {
            if (c == keymap[i]) {
                if (prev_note == i) break;
                prev_note = i;
                tone_play(pin, notes[i], 500);
                break;
            }
        }
        if (c >= 'a' && c <= 'z') {
            bool found = false;
            for (int i = 0; keymap[i]; i++) if (c == keymap[i]) { found = true; break; }
                if (!found) { tone_stop(); prev_note = -1; }
        } else { tone_stop(); prev_note = -1; }
    }
    tone_stop();
}

static void cmd_la(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage: la <pin> [samples] [us] [trigger]\n");
        printf("  Quick logic analyser on any GPIO\n");
        printf("  samples: 64-4096 (default 256)\n");
        printf("  us     : sampling period in us (1-1000, default 10)\n");
        printf("  trigger: 0=off 1=rising 2=falling\n");
        return;
    }
    uint pin = (uint)atoi(argv[1]);
    uint samples = (argc >= 3) ? (uint)atoi(argv[2]) : 256;
    uint period_us = (argc >= 4) ? (uint)atoi(argv[3]) : 10;
    uint trigger = (argc >= 5) ? (uint)atoi(argv[4]) : 1;
    if (samples < 64) samples = 64;
    if (samples > 4096) samples = 4096;
    if (period_us < 1) period_us = 1;
    if (period_us > 1000) period_us = 1000;

    hal_gpio_init(pin);
    hal_gpio_set_dir(pin, false);

    printf("Logic analyser GP%d\n", pin);
    printf("samples: %u, period: %u us, trigger: %s\n",
        samples, period_us, trigger == 0 ? "off" : (trigger == 1 ? "rising" : "falling"));
    printf("Press Ctrl-C to abort\n");

    uint8_t *buf = (uint8_t *)malloc(samples);
    if (!buf) { printf("out of memory\n"); return; }

    if (trigger > 0) {
        int expected = (trigger == 1) ? 0 : 1;
        int want = (trigger == 1) ? 1 : 0;
        printf("Waiting for %s edge...\n", trigger == 1 ? "rising" : "falling");
        while (true) {
            int val = hal_gpio_get(pin);
            if (val == expected) {
                while (hal_gpio_get(pin) != want) hal_sleep_us(1);
                break;
            }
        }
    }

    for (uint i = 0; i < samples; i++) {
        buf[i] = (uint8_t)hal_gpio_get(pin);
        hal_sleep_us(period_us);
    }

