enginestein/DeckOS_ESP32/main/commands/commands.c
    uint32_t ns = period_us * 1000;
    printf("\nLA snapshot (%u samples x %u us = %u ms):\n", samples, period_us, (samples * period_us) / 1000);
    printf("time      signal\n");
    printf("--------  ------\n");
    int run_start = -1;
    int run_val = -1;
    int printed = 0;
    for (uint i = 0; i < samples; i++) {
        if (run_start < 0) {
            run_start = (int)i;
            run_val = buf[i];
        }
        if (i == samples - 1 || buf[i + 1] != run_val) {
            if (run_val == 1 && (i - run_start) > 0) {
                uint32_t t_ns = run_start * ns;
                uint32_t dur = (i - run_start + 1) * period_us;
                printf("%u.%03u ms  HIGH for %lu us  [%d-%d]\n",
                    (unsigned)(t_ns / 1000000), (unsigned)((t_ns % 1000000) / 1000),
                    (unsigned long)dur, run_start, i);
                printed++;
            }
            run_start = -1;
        }
    }
    printf("--- %d high pulses captured ---\n", printed);
    printf("approx freq: %.1f Hz\n", 1000000.0 / (period_us * 2));
    fflush(stdout);
    free(buf);
}

static void cmd_scope(int argc, char *argv[]) {
    if (argc < 3) {
        printf("usage: scope <pin> <hz> <ms>\n");
        printf("  Clean waveform viewer for regular signals\n");
        printf("  pin: GPIO to sample\n");
        printf("  hz: expected signal frequency\n");
        printf("  ms: capture duration\n");
        return;
    }
    int pin = atoi(argv[1]);
    int hz = atoi(argv[2]);
    int ms = (argc >= 4) ? atoi(argv[3]) : 20;
    if (hz < 1 || ms < 1) { printf("invalid params\n"); return; }

    hal_gpio_init(pin);
    hal_gpio_set_dir(pin, false);

    uint period_us = 1000000 / hz / 20;
    if (period_us < 1) period_us = 1;
    if (period_us > 10000) period_us = 10000;
    int total_samples = (ms * 1000) / period_us;
    if (total_samples > 2048) total_samples = 2048;
    if (total_samples < 10) { printf("capture too short\n"); return; }

    uint8_t *sample = (uint8_t *)malloc(total_samples);
    if (!sample) { printf("OOM\n"); return; }

    printf("Scope GP%d: %d Hz, %d ms (%d samples, %u us period)\n",
        pin, hz, ms, total_samples, period_us);

    for (int i = 0; i < total_samples; i++) {
        sample[i] = (uint8_t)hal_gpio_get(pin);
        hal_sleep_us(period_us);
    }

    int rows = 12, cols = 80;
    for (int r = 0; r < rows; r++) {
        float thresh = 1.0f - (float)r / (rows - 1);
        int pos = 0;
        for (int c = 0; c < cols; c++) {
            int idx = (c * total_samples) / cols;
            if (idx >= total_samples) idx = total_samples - 1;
            int group_size = 1;
            int high_count = 0;
            for (int j = 0; j < group_size && idx + j < total_samples; j++)
                if (sample[idx + j]) high_count++;
            float avg = (float)high_count / group_size;
            pos += (avg > thresh) ? 1 : 0;
            putchar(avg > thresh ? '#' : ' ');
        }
        printf(" %d%%\n", (int)(thresh * 100));
    }
    fflush(stdout);
    free(sample);
}

static void cmd_detect(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  detect scan              - scan for UART & i2c devices\n");
        printf("  detect uart <pin>        - probe one pin for UART activity\n");
        printf("  detect analyze <pin>     - pulse width analysis\n");
        return;
    }

    if (strcmp(argv[1], "scan") == 0) {
        printf("=== Device Detection Scan ===\n");
        device_detect_print(21, 22);
    } else if (strcmp(argv[1], "uart") == 0) {
        if (argc < 3) { printf("need pin\n"); return; }
        uart_detect_run((uint8_t)atoi(argv[2]), 3000);
    } else if (strcmp(argv[1], "analyze") == 0) {
        if (argc < 3) { printf("need pin\n"); return; }
        la_detect_protocol((uint8_t)atoi(argv[2]), 200, 1);
    } else printf("unknown detect: %s\n", argv[1]);
}

static void cmd_sleep(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: sleep <ms>\n"); return; }
    int ms = atoi(argv[1]);
    if (ms < 1) { printf("ms must be > 0\n"); return; }
    if (ms > 10000) { printf("max 10s\n"); return; }
    hal_sleep_ms((uint)ms);
    printf("slept %d ms\n", ms);
}

static void cmd_repeat(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: repeat <n> <command...>\n"); return; }
    int n = atoi(argv[1]);
    if (n < 1 || n > 1000) { printf("n must be 1-1000\n"); return; }
    char cmd[256]; argv_join(cmd, sizeof(cmd), argc, argv, 2);
    for (int i = 0; i < n; i++) {
        printf("[%d/%d] %s\n", i + 1, n, cmd);
        commands_execute(cmd);
    }
}

static void cmd_watch(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: watch <ms> <command...>\n"); return; }
    int ms = atoi(argv[1]);
    if (ms < 20) ms = 20;
    if (ms > 60000) ms = 60000;
    char cmd[256]; argv_join(cmd, sizeof(cmd), argc, argv, 2);
    printf("Watching every %d ms: %s\n", ms, cmd);
    int n = 0;
    while (true) {
        printf("[%d]\n", ++n);
        commands_execute(cmd);
        int waited = 0;
        while (waited < ms) {
            kernel_poll();
            hal_sleep_ms(10);
            waited += 10;
            int c = hal_console_getchar();
            if (c >= 0) { printf("-- abort --\n"); return; }
        }
    }
}

static void cmd_trigger(int argc, char *argv[]) {
    if (argc < 4) {
        printf("usage: trigger <pin> <rise|fall|both> <command...>\n");
        return;
    }
    int pin = atoi(argv[1]);
    int edge = 0;
    if (strcmp(argv[2], "rise") == 0) edge = 1;
    else if (strcmp(argv[2], "fall") == 0) edge = 2;
    else if (strcmp(argv[2], "both") == 0) edge = 3;
    else { printf("edge must be: rise fall both\n"); return; }
    char cmd[256]; argv_join(cmd, sizeof(cmd), argc, argv, 3);

    hal_gpio_init(pin);
    hal_gpio_set_dir(pin, false);
    int last = hal_gpio_get(pin);
    printf("Trigger on GP%d (%s): %s\n", pin, argv[2], cmd);
    printf("Press Ctrl-C to stop\n");

    while (true) {
        int cur = hal_gpio_get(pin);
        if ((edge & 1) && last == 0 && cur == 1) {
            printf("RISE on GP%d -> ", pin);
            commands_execute(cmd);
        }
        if ((edge & 2) && last == 1 && cur == 0) {
            printf("FALL on GP%d -> ", pin);
            commands_execute(cmd);
        }
        last = cur;
        kernel_poll();
        hal_sleep_ms(10);
        int c = hal_console_getchar();
        if (c >= 0) { printf("trigger stopped\n"); return; }
    }
}

