enginestein/DeckOS_ESP32/main/commands/commands.c
static void cmd_cron(int argc, char *argv[]) {
    if (argc < 3) {
        printf("usage: cron <delay_ms> [command...]\n");
        printf("  Schedule a delayed command (max 1 min)\n");
        return;
    }
    int delay_ms = atoi(argv[1]);
    if (delay_ms < 100 || delay_ms > 60000) { printf("delay 100-60000 ms\n"); return; }
    char cmd[256]; argv_join(cmd, sizeof(cmd), argc, argv, 2);
    printf("cron delayed execution not implemented: %s\n", cmd);
    printf("Scheduled in %d ms: %s\n", delay_ms, cmd);
}

static void cmd_bench(int argc, char *argv[]) {
    if (argc < 3) { printf("usage: bench <iters> <command...>\n"); return; }
    int iters = atoi(argv[1]);
    if (iters < 1 || iters > 10000) { printf("iters 1-10000\n"); return; }
    char cmd[256]; argv_join(cmd, sizeof(cmd), argc, argv, 2);
    bench_run(cmd, iters);
}

static void cmd_time(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: time <command...>\n"); return; }
    char cmd[256]; argv_join(cmd, sizeof(cmd), argc, argv, 1);
    uint64_t t0 = hal_time_us();
    commands_execute(cmd);
    uint64_t t1 = hal_time_us();
    uint64_t dt = t1 - t0;
    printf("time: %llu us (%.3f ms)\n", dt, dt / 1000.0);
}

#define MAX_ALIASES 64
static char *s_alias_names[MAX_ALIASES];
static char *s_alias_cmds[MAX_ALIASES];
static int s_alias_count = 0;

static void alias_add(const char *name, const char *cmd) {
    for (int i = 0; i < s_alias_count; i++) {
        if (strcmp(s_alias_names[i], name) == 0) {
            free(s_alias_cmds[i]);
            s_alias_cmds[i] = strdup(cmd);
            return;
        }
    }
    if (s_alias_count >= MAX_ALIASES) { printf("max aliases (%d) reached\n", MAX_ALIASES); return; }
    s_alias_names[s_alias_count] = strdup(name);
    s_alias_cmds[s_alias_count] = strdup(cmd);
    s_alias_count++;
}

const char *alias_lookup(const char *name) {
    for (int i = 0; i < s_alias_count; i++)
        if (strcmp(s_alias_names[i], name) == 0) return s_alias_cmds[i];
    return NULL;
}

static void cmd_alias(int argc, char *argv[]) {
    if (argc == 1) {
        for (int i = 0; i < s_alias_count; i++)
            printf("alias %s='%s'\n", s_alias_names[i], s_alias_cmds[i]);
        return;
    }
    if (argc == 2) {
        const char *v = alias_lookup(argv[1]);
        if (v) printf("alias %s='%s'\n", argv[1], v);
        else printf("no such alias: %s\n", argv[1]);
        return;
    }
    char cmd[256]; argv_join(cmd, sizeof(cmd), argc, argv, 2);
    alias_add(argv[1], cmd);
}

static void cmd_unalias(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: unalias <name>\n"); return; }
    for (int i = 0; i < s_alias_count; i++) {
        if (strcmp(s_alias_names[i], argv[1]) == 0) {
            free(s_alias_names[i]); free(s_alias_cmds[i]);
            s_alias_names[i] = s_alias_names[s_alias_count - 1];
            s_alias_cmds[i] = s_alias_cmds[s_alias_count - 1];
            s_alias_count--;
            printf("removed alias '%s'\n", argv[1]);
            return;
        }
    }
    printf("no such alias: %s\n", argv[1]);
}

static void cmd_power(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("VSYS: %.2f V  (ESP32 VBUS monitor)\n", 5.0);
    printf("Battery sense: N/A\n");
}

static void cmd_free(int argc, char *argv[]) {
    (void)argc; (void)argv;
    heap_track_report();
}

static void cmd_sysinfo(int argc, char *argv[]) {
    (void)argc; (void)argv;
    const board_info_t *b = board_detect();
    printf("========================================\n");
    printf("DeckOS v6.0\n");
    printf("Board: %s\n", b->name);
    printf("Build: %s %s\n", __DATE__, __TIME__);
    printf("uptime: ");
    print_uptime();
    printf("\n");
    printf("Flash: %lu KB | PSRAM: %s | SD: %s | CAM: %s\n",
        b->flash_kb, b->has_psram ? "Y" : "N", b->has_sdcard ? "Y" : "N", b->has_camera ? "Y" : "N");
    printf("Commands issued: %lu, unknown: %lu\n", s_cmd_count, s_unknown_count);
    printf("========================================\n");
}

static void cmd_uname(int argc, char *argv[]) {
    bool all = (argc > 1 && strcmp(argv[1], "-a") == 0);
    const board_info_t *b = board_detect();
    printf("DeckOS v6.0 %s", b->name);
    if (all) printf(" xtensa-esp32");
    printf("\n");
}

static void cmd_rand(int argc, char *argv[]) {
    int minv = (argc >= 2) ? atoi(argv[1]) : 0;
    int maxv = (argc >= 3) ? atoi(argv[2]) : RAND_MAX;
    if (minv > maxv) { int t = minv; minv = maxv; maxv = t; }
    if (minv == maxv) { printf("%d\n", minv); return; }
    int r = rand();
    r = minv + r % (maxv - minv + 1);
    printf("%d\n", r);
}

static void cmd_reboot(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("rebooting...\n");
    fflush(stdout);
    hal_sleep_ms(100);
    hal_reboot();
}

static void cmd_drivers(int argc, char *argv[]) {
    (void)argc; (void)argv;
    drivers_list();
}

static void cmd_tasks(int argc, char *argv[]) {
    if (argc < 2) {
        sched_list();
        return;
    }
    if (strcmp(argv[1], "list") == 0) sched_list();
    else if (strcmp(argv[1], "enable") == 0) {
        if (argc < 3) { printf("need task id\n"); return; }
        sched_enable(atoi(argv[2]), true);
    } else if (strcmp(argv[1], "disable") == 0) {
        if (argc < 3) { printf("need task id\n"); return; }
        sched_enable(atoi(argv[2]), false);
    } else printf("unknown: %s\n", argv[1]);
}

static void cmd_config(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: config show|set <key> <val>|save|reset\n"); return; }
    flash_config_t *cfg = &g_config;
    if (strcmp(argv[1], "show") == 0) {
        config_print(cfg);
    } else if (strcmp(argv[1], "save") == 0) {
        config_save(cfg);
    } else if (strcmp(argv[1], "reset") == 0) {
        config_defaults(cfg);
        config_save(cfg);
        printf("config reset to defaults\n");
    } else printf("unknown config subcommand\n");
}

static void cmd_syslog(int argc, char *argv[]) {
    if (argc < 2) { printf("usage: syslog show|warn|err|write <msg>|clear|stats\n"); return; }
    if (strcmp(argv[1], "show") == 0) {
        syslog_dump(LOG_INFO, 50);
    } else if (strcmp(argv[1], "warn") == 0) {
        const char *msg = (argc >= 3) ? argv[2] : "manual warning";
        LOG_W("cmd", msg);
        printf("syslog warning written\n");
    } else if (strcmp(argv[1], "err") == 0) {
        const char *msg = (argc >= 3) ? argv[2] : "manual error";
        LOG_E("cmd", msg);
        printf("syslog error written\n");
    } else if (strcmp(argv[1], "write") == 0) {
        if (argc < 3) { printf("need message\n"); return; }
        LOG_I("cmd", argv[2]);
        printf("syslog info written\n");
    } else if (strcmp(argv[1], "clear") == 0) {
        syslog_clear();
    } else if (strcmp(argv[1], "stats") == 0) {
        printf("syslog: %lu entries\n", (unsigned long)syslog_total());
    } else printf("unknown syslog: %s\n", argv[1]);
}

static void cmd_jobs(int argc, char *argv[]) {
    (void)argc; (void)argv;
    bg_job_list();
}

static void cmd_date(int argc, char *argv[]) {
    if (argc >= 7) {
        struct tm tm;
        memset(&tm, 0, sizeof(tm));
        tm.tm_year = atoi(argv[1]) - 1900;
        tm.tm_mon  = atoi(argv[2]) - 1;
        tm.tm_mday = atoi(argv[3]);
        tm.tm_hour = atoi(argv[4]);
        tm.tm_min  = atoi(argv[5]);
        tm.tm_sec  = atoi(argv[6]);
        time_t t = mktime(&tm);
        if (t < 0) { printf("invalid date\n"); return; }
        struct timeval tv = { .tv_sec = t, .tv_usec = 0 };
        settimeofday(&tv, NULL);
        printf("RTC set to %04d-%02d-%02d %02d:%02d:%02d\n",
            atoi(argv[1]), atoi(argv[2]), atoi(argv[3]),
            atoi(argv[4]), atoi(argv[5]), atoi(argv[6]));
        return;
    }
    time_t now;
    time(&now);
    struct tm *lt = localtime(&now);
    char buf[64];
    strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", lt);
    printf("RTC: %s\n", buf);
}

