enginestein/DeckOS_ESP32/main/commands/commands.c
static void cmd_history(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("history: (built-in shell history not yet available through this command)\n");
}

static void cmd_stats(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("Runtime statistics:\n");
    printf("  commands issued : %lu\n", s_cmd_count);
    printf("  unknown         : %lu\n", s_unknown_count);
    printf("  missed tasks    : (check syslog)\n");
}

static void cmd_top(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("=== Top ===\n");
    printf("uptime: "); print_uptime(); printf("\n");
    heap_track_report();
    sched_list();
}

static void cmd_uart(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  uart passthrough <baud> <tx> <rx> [timeout_s]\n");
        return;
    }
    if (strcmp(argv[1], "passthrough") == 0) {
        if (argc < 5) { printf("usage: uart passthrough <baud> <tx> <rx> [timeout_s]\n"); return; }
        int baud = atoi(argv[2]);
        int tx = atoi(argv[3]);
        int rx = atoi(argv[4]);
        int timeout_s = (argc >= 6) ? atoi(argv[5]) : 30;
        uart_passthrough((uint)tx, (uint)rx, (uint)baud, (uint32_t)(timeout_s * 1000));
    } else printf("unknown uart: %s\n", argv[1]);
}

// esp32 specific commands

static void cmd_board(int argc, char *argv[]) {
    (void)argc; (void)argv;
    printf("Board: %s\n", hal_board_name());
    printf("Chip: ESP32\n");
    printf("Flash: %lu KB\n", (unsigned long)(hal_board_flash_size() / 1024));
    printf("PSRAM: %lu KB\n", (unsigned long)(hal_board_psram_size() / 1024));
    printf("Camera: %s\n", hal_board_has_camera() ? "yes" : "no");
    printf("SD Card: %s\n", hal_board_has_sdcard() ? "yes" : "no");
}

static void cmd_psram(int argc, char *argv[]) {
    (void)argc; (void)argv;
    uint32_t total = hal_board_psram_size();
    printf("PSRAM total: %lu KB\n", (unsigned long)(total / 1024));
    if (total > 0) {
        printf("PSRAM free: %lu KB\n",
               (unsigned long)(heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024));
        printf("PSRAM largest: %lu KB\n",
               (unsigned long)(heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM) / 1024));
    }
}

// Camera (ESP32-CAM)
#include "camera_esp32.h"
#include "wifi.h"

static void cmd_camera(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  camera init                  init the camera\n");
        printf("  camera capture               capture and dump JPEG info\n");
        printf("  camera save [path]           save capture to SPIFFS\n");
        printf("  camera ls                    list saved captures\n");
        printf("  camera info                  show camera info\n");
        printf("  camera res <qqvga|qvga|vga|svga|xga|sxga|uxga>\n");
        printf("  camera quality <10-63>       set JPEG quality\n");
        printf("  camera brightness <-2..2>    set brightness\n");
        printf("  camera contrast <-2..2>      set contrast\n");
        printf("  camera stream                start MJPEG stream on port 80\n");
        printf("  camera stream stop           stop MJPEG stream\n");
        return;
    }
    if (strcmp(argv[1], "init") == 0) {
        if (deck_cam_init()) printf("Camera initialised\n");
        else printf("Camera init FAILED\n");
    } else if (strcmp(argv[1], "capture") == 0) {
        cam_frame_t f;
        if (deck_cam_capture(&f)) {
            printf("captured %dx%d %s (%zu bytes)\n",
                   f.width, f.height, f.jpeg ? "JPEG" : "RAW", f.len);
            deck_cam_return_frame(&f);
        } else printf("capture failed\n");
    } else if (strcmp(argv[1], "ls") == 0) {
        deck_cam_list();
    } else if (strcmp(argv[1], "save") == 0) {
        if (!deck_cam_is_ready()) { printf("camera not initialised\n"); return; }
        if (argc >= 3) {
            deck_cam_save(argv[2]);
        } else {
            deck_cam_save_auto();
        }
    } else if (strcmp(argv[1], "info") == 0) {
        deck_cam_print_info();
    } else if (strcmp(argv[1], "res") == 0 && argc >= 3) {
        const char* res_str[] = {"qqvga","qvga","vga","svga","xga","sxga","uxga"};
        for (int i = 0; i < 7; i++) {
            if (strcmp(argv[2], res_str[i]) == 0) {
                deck_cam_set_resolution((cam_resolution_t)i);
                printf("resolution set to %s\n", res_str[i]);
                return;
            }
        }
        printf("unknown resolution\n");
    } else if (strcmp(argv[1], "quality") == 0 && argc >= 3) {
        deck_cam_set_quality((uint8_t)atoi(argv[2]));
        printf("quality set\n");
    } else if (strcmp(argv[1], "brightness") == 0 && argc >= 3) {
        deck_cam_set_brightness((int8_t)atoi(argv[2]));
        printf("brightness set\n");
    } else if (strcmp(argv[1], "contrast") == 0 && argc >= 3) {
        deck_cam_set_contrast((int8_t)atoi(argv[2]));
        printf("contrast set\n");
    } else if (strcmp(argv[1], "stream") == 0) {
        if (argc >= 3 && strcmp(argv[2], "stop") == 0) {
            deck_cam_stream_stop();
            printf("stream stopped\n");
        } else if (deck_cam_stream_start()) {
            printf("MJPEG stream at http://%s/\n", wifi_get_ip());
        } else {
            printf("stream start failed\n");
        }
    } else printf("unknown camera: %s\n", argv[1]);
}

// WiFi (native ESP32)
#include "wifi.h"

static void cmd_wifi(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  wifi init                    init WiFi subsystem\n");
        printf("  wifi ap <ssid> [pass]        start softAP mode\n");
        printf("  wifi scan                    scan for networks\n");
        printf("  wifi join <ssid> <pass>      connect to network\n");
        printf("  wifi disconnect              disconnect\n");
        printf("  wifi status                  show connection state\n");
        printf("  wifi get <url>               HTTP GET\n");
        printf("  wifi post <url> <body>       HTTP POST\n");
        return;
    }
    if (strcmp(argv[1], "init") == 0) {
        if (wifi_init()) printf("WiFi initialised\n");
        else printf("WiFi init FAILED\n");
    } else if (strcmp(argv[1], "ap") == 0 && argc >= 3) {
        const char* pass = (argc >= 4) ? argv[3] : "";
        if (wifi_ap_start(argv[2], pass)) {
            printf("AP '%s' started at 192.168.4.1\n", argv[2]);
        } else printf("AP start failed\n");
    } else if (strcmp(argv[1], "scan") == 0) {
        wifi_ap_t aps[20];
        int count = 0;
        if (wifi_scan(aps, 20, &count)) {
            printf("Networks found: %d\n", count);
            for (int i = 0; i < count; i++) {
                printf("  %-32s  RSSI: %4d dBm\n", aps[i].ssid, aps[i].rssi);
            }
        } else printf("scan failed\n");
    } else if (strcmp(argv[1], "join") == 0 && argc >= 4) {
        if (wifi_connect(argv[2], argv[3])) {
            printf("Connected! IP: %s\n", wifi_get_ip());
        } else printf("Connection failed\n");
    } else if (strcmp(argv[1], "disconnect") == 0) {
        wifi_disconnect();
        printf("Disconnected\n");
    } else if (strcmp(argv[1], "status") == 0) {
        wifi_print_status();
    } else if (strcmp(argv[1], "get") == 0 && argc >= 3) {
        char resp[2048];
        if (wifi_http_get(argv[2], resp, sizeof(resp))) {
            printf("%s\n", resp);
        } else printf("HTTP GET failed\n");
    } else if (strcmp(argv[1], "post") == 0 && argc >= 4) {
        char resp[2048];
        if (wifi_http_post(argv[2], argv[3], resp, sizeof(resp))) {
            printf("%s\n", resp);
        } else printf("HTTP POST failed\n");
    } else printf("unknown wifi: %s\n", argv[1]);
}

// Bluetooth (native ESP32)

