enginestein/DeckOS_ESP32/main/commands/commands.c
static void cmd_bt(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  bt init              init Bluetooth (SPP)\n");
        printf("  bt deinit            power down Bluetooth\n");
        printf("  bt status            show connection state\n");
        printf("  bt shell             interactive BT shell\n");
        return;
    }
    if (strcmp(argv[1], "init") == 0) {
        if (bt_init(115200)) printf("Bluetooth initialised\n");
        else printf("BT init FAILED\n");
    } else if (strcmp(argv[1], "deinit") == 0) {
        bt_deinit();
        printf("Bluetooth deinitialised\n");
    } else if (strcmp(argv[1], "status") == 0) {
        printf("BT: %s\n", bt_is_connected() ? "connected" : "disconnected");
    } else if (strcmp(argv[1], "shell") == 0) {
        bt_shell();
    } else printf("unknown bt: %s\n", argv[1]);
}

// Swarm / ESP-NOW
static void cmd_swarm(int argc, char *argv[]) {
    if (argc < 2) {
        printf("usage:\n");
        printf("  swarm init             - start ESP-NOW mesh\n");
        printf("  swarm id <name>        - set this node's name\n");
        printf("  swarm mac              - show this node's MAC\n");
        printf("  swarm peer <MAC>       - register a peer node\n");
        printf("  swarm pub <lat> <lon> <alt> <hdg> <state>  - broadcast position\n");
        printf("  swarm list             - show all known peers\n");
        printf("  swarm stop             - stop the mesh\n");
        return;
    }

    if (strcmp(argv[1], "init") == 0) {
        if (swarm_init()) printf("swarm: ESP-NOW mesh started\n");
        else printf("swarm: init FAILED\n");
    } else if (strcmp(argv[1], "id") == 0 && argc >= 3) {
        swarm_set_id(argv[2]);
    } else if (strcmp(argv[1], "mac") == 0) {
        const char *mac = swarm_get_mac_str();
        if (mac && mac[0]) printf("swarm MAC: %s\n", mac);
        else printf("swarm: not initialised\n");
    } else if (strcmp(argv[1], "peer") == 0 && argc >= 3) {
        swarm_add_peer(argv[2]);
    } else if (strcmp(argv[1], "pub") == 0 && argc >= 7) {
        float lat = atof(argv[2]);
        float lon = atof(argv[3]);
        float alt = atof(argv[4]);
        float hdg = atof(argv[5]);
        int state = atoi(argv[6]);
        if (!swarm_is_active()) {
            printf("swarm: not initialised - run 'swarm init' first\n");
            return;
        }
        swarm_publish(lat, lon, alt, hdg, (uint8_t)state);
    } else if (strcmp(argv[1], "list") == 0) {
        if (!swarm_is_active()) {
            printf("swarm: not initialised\n");
            return;
        }
        int n = swarm_peer_count();
        printf("swarm peers (%d):\n", n);
        for (int i = 0; i < n; i++) {
            const swarm_peer_t *p = swarm_get_peer(i);
            if (p) {
                printf("  %d. %02X:%02X:%02X:%02X:%02X:%02X  %s\n",
                       i + 1,
                       p->mac[0], p->mac[1], p->mac[2],
                       p->mac[3], p->mac[4], p->mac[5],
                       p->name);
                if (p->last_seen > 0) {
                    printf("     lat=%.4f lon=%.4f alt=%.1f hdg=%.1f state=%d last_seen=%lu\n",
                           p->lat, p->lon, p->alt, p->hdg, p->state,
                           (unsigned long)p->last_seen);
                }
            }
        }
    } else if (strcmp(argv[1], "stop") == 0) {
        swarm_stop();
    } else {
        printf("swarm: unknown subcommand '%s'\n", argv[1]);
    }
}

typedef void (*cmd_func_t)(int argc, char *argv[]);
typedef struct { const char *name; cmd_func_t func; } cmd_entry_t;

static int cmd_func_compare(const void *a, const void *b) {
    return strcmp(((const cmd_entry_t*)a)->name, ((const cmd_entry_t*)b)->name);
}

static const cmd_entry_t s_cmd_table[] = {
    {"adc",       cmd_adc},
    {"alias",     cmd_alias},
    {"append",    cmd_append},
    {"avg",       cmd_avg},
    {"bench",     cmd_bench},
    {"board",     cmd_board},
    {"bt",        cmd_bt},
    {"camera",    cmd_camera},
    {"cat",       cmd_cat},
    {"cd",        cmd_cd},
    {"clear",     cmd_clear},
    {"config",    cmd_config},
    {"console",   cmd_console},
    {"cp",        cmd_cp},
    {"cron",      cmd_cron},
    {"date",      cmd_date},
    {"detect",    cmd_detect},
    {"df",        cmd_df},
    {"drivers",   cmd_drivers},
    {"echo",      cmd_echo},
    {"find",      cmd_find},
    {"free",      cmd_free},
    {"gpio",      cmd_gpio},
    {"grep",      cmd_grep},
    {"help",      cmd_help},
    {"hexdump",   cmd_hexdump},
    {"hid",       cmd_hid},
    {"history",   cmd_history},
    {"i2c",       cmd_i2c},
    {"imu",       cmd_imu},
    {"iwrite",    cmd_iwrite},
    {"jobs",      cmd_jobs},
    {"la",        cmd_la},
    {"led",       cmd_led},
    {"ls",        cmd_ls},
    {"melody",    cmd_melody},
    {"mem",       cmd_mem},
    {"mkdir",     cmd_mkdir},
    {"morse",     cmd_morse},
    {"mv",        cmd_mv},
    {"oled",      cmd_oled},
    {"piano",     cmd_piano},
    {"pin",       cmd_pin},
    {"power",     cmd_power},
    {"psram",     cmd_psram},
    {"pull",      cmd_pull},
    {"pwd",       cmd_pwd},
    {"pwm",       cmd_pwm},
    {"rand",      cmd_rand},
    {"reboot",    cmd_reboot},
    {"repeat",    cmd_repeat},
    {"rm",        cmd_rm},
    {"scope",     cmd_scope},
    {"servo",     cmd_servo},
    {"sleep",     cmd_sleep},
    {"spi",       cmd_spi},
    {"stat",      cmd_stat},
    {"stats",     cmd_stats},
    {"swarm",     cmd_swarm},
    {"sysinfo",   cmd_sysinfo},
    {"syslog",    cmd_syslog},
    {"tasks",     cmd_tasks},
    {"temp",      cmd_temp},
    {"time",      cmd_time},
    {"tone",      cmd_tone},
    {"top",       cmd_top},
    {"touch",     cmd_touch},
    {"tree",      cmd_tree},
    {"trigger",   cmd_trigger},
    {"uart",      cmd_uart},
    {"unalias",   cmd_unalias},
    {"uname",     cmd_uname},
    {"uptime",    cmd_uptime},
    {"usb",       cmd_usb},
    {"version",   cmd_version},
    {"watch",     cmd_watch},
    {"wc",        cmd_wc},
    {"wdog",      cmd_wdog},
    {"wifi",      cmd_wifi},
    {"write",     cmd_write},
};

static const int s_cmd_count_tbl = sizeof(s_cmd_table) / sizeof(s_cmd_table[0]);

bool commands_execute(const char *line) {
    if (!line || line[0] == '\0' || line[0] == '#') return true;
    s_cmd_count++;

    char buf[384];
    strncpy(buf, line, sizeof(buf) - 1);
    buf[sizeof(buf) - 1] = '\0';

    int argc = 0;
    char *argv_[64];
    char *p = buf;
    while (*p) {
        while (*p == ' ' || *p == '\t') *p++ = '\0';
        if (!*p) break;
        if (*p == '"') {
            argv_[argc++] = ++p;
            while (*p && *p != '"') p++;
            if (*p) *p++ = '\0';
        } else {
            argv_[argc++] = p;
            while (*p && *p != ' ' && *p != '\t') p++;
            if (*p) *p++ = '\0';
        }
        if (argc >= 64) break;
    }

    if (argc == 0) return true;

    const char *alias = alias_lookup(argv_[0]);
    if (alias) {
        char expanded[384];
        snprintf(expanded, sizeof(expanded), "%s %s", alias, buf + strlen(argv_[0]));
        while (*expanded && (*expanded == ' ' || *expanded == '\t'));
        return commands_execute(expanded);
    }

    cmd_entry_t key = {argv_[0], NULL};
    const cmd_entry_t *found = (const cmd_entry_t *)bsearch(&key, s_cmd_table, s_cmd_count_tbl,
        sizeof(cmd_entry_t), cmd_func_compare);
    if (found) {
        found->func(argc, argv_);
        return true;
    }

    s_unknown_count++;
    printf("unknown command: %s\n", argv_[0]);
    return false;
}

void commands_init(void) {
    s_boot_us = hal_time_us();
    srand((unsigned)hal_time_us());
    printf("commands initted (%d commands)\n", s_cmd_count_tbl);
}

void commands_list(void) {
    for (int i = 0; i < s_cmd_count_tbl; i++)
        printf("%s ", s_cmd_table[i].name);
    printf("\n");
}
